{
    "manifest": {
        "id": "trane::music::saxophone::tenor::modal_exploration_1",
        "name": "Tenor Saxophone - Modal Exploration",
        "description": "Explore the major and minor modes on the tenor saxophone.",
        "dependencies": [
            "trane::music::saxophone::tenor::basic_mobility"
        ],
        "authors": [
            "The Trane Project"
        ],
        "metadata": {
            "instrument": [
                "saxophone",
                "tenor_saxophone"
            ]
        },
        "generator_config": {
            "KnowledgeBase": {}
        }
    },
    "lessons": [
        {
            "short_id": "c",
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of C major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to C major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of C major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to C major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "c_more_intervals",
            "dependencies": ["c"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of C major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to C major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of C major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to C major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of C major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to C major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of C major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to C major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of C major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to C major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "g",
            "dependencies": ["c"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of G major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to G major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of G major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to G major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "g_more_intervals",
            "dependencies": ["g"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of G major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to G major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of G major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to G major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of G major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to G major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of G major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to G major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of G major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to G major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "d",
            "dependencies": ["g"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of D major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to D major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of D major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to D major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "d_more_intervals",
            "dependencies": ["d"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of D major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to D major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of D major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to D major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of D major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to D major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of D major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to D major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of D major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to D major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "a",
            "dependencies": ["d"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of A major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to A major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of A major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to A major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "a_more_intervals",
            "dependencies": ["a"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of A major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to A major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of A major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to A major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of A major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to A major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of A major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to A major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of A major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to A major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "e",
            "dependencies": ["a"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of E major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to E major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of E major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to E major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "e_more_intervals",
            "dependencies": ["e"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of E major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to E major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of E major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to E major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of E major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to E major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of E major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to E major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of E major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to E major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "b",
            "dependencies": ["e"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of B major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to B major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of B major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to B major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "b_more_intervals",
            "dependencies": ["b"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of B major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to B major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of B major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to B major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of B major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to B major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of B major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to B major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of B major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to B major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "f",
            "dependencies": ["c"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of F major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to F major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of F major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to F major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "f_more_intervals",
            "dependencies": ["f"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of F major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to F major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of F major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to F major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of F major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to F major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of F major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to F major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of F major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to F major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "b_flat",
            "dependencies": ["f"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of Bb major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Bb major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of Bb major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Bb major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "b_flat_more_intervals",
            "dependencies": ["b_flat"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of Bb major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Bb major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of Bb major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Bb major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of Bb major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Bb major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of Bb major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Bb major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of Bb major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Bb major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "e_flat",
            "dependencies": ["b_flat"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of Eb major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Eb major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of Eb major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Eb major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "e_flat_more_intervals",
            "dependencies": ["e_flat"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of Eb major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Eb major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of Eb major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Eb major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of Eb major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Eb major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of Eb major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Eb major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of Eb major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Eb major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "a_flat",
            "dependencies": ["e_flat"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of Ab major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Ab major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of Ab major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Ab major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "a_flat_more_intervals",
            "dependencies": ["a_flat"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of Ab major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Ab major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of Ab major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Ab major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of Ab major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Ab major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of Ab major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Ab major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of Ab major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Ab major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "d_flat",
            "dependencies": ["a_flat"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of Db major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Db major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of Db major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Db major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "d_flat_more_intervals",
            "dependencies": ["d_flat"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of Db major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Db major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of Db major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Db major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of Db major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Db major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of Db major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Db major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of Db major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Db major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "g_flat",
            "dependencies": ["d_flat"],
            "exercises": [
                {
                    "short_id": "major_seconds",
                    "front": [
                        "Explore the major scale in the key of Gb major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "minor_seconds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Gb major in your tenor saxophone using primarily second intervals."
                    ]
                },
                {
                    "short_id": "major_thirds",
                    "front": [
                        "Explore the major scale in the key of Gb major in your tenor saxophone using primarily third intervals."
                    ]
                } ,
                {
                    "short_id": "minor_thirds",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Gb major in your tenor saxophone using primarily third intervals."
                    ]
                }
            ]
        },
        {
            "short_id": "g_flat_more_intervals",
            "dependencies": ["g_flat"],
            "exercises": [
                {
                    "short_id": "major_fourths",
                    "front": [
                        "Explore the major scale in the key of Gb major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "minor_fourths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Gb major in your tenor saxophone using primarily fourth intervals."
                    ]
                },
                {
                    "short_id": "major_fifths",
                    "front": [
                        "Explore the major scale in the key of Gb major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "minor_fifths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Gb major in your tenor saxophone using primarily fifth intervals."
                    ]
                },
                {
                    "short_id": "major_sixths",
                    "front": [
                        "Explore the major scale in the key of Gb major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "minor_sixths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Gb major in your tenor saxophone using primarily sixth intervals."
                    ]
                },
                {
                    "short_id": "major_sevenths",
                    "front": [
                        "Explore the major scale in the key of Gb major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "minor_sevenths",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Gb major in your tenor saxophone using primarily seventh intervals."
                    ]
                },
                {
                    "short_id": "major_octaves",
                    "front": [
                        "Explore the major scale in the key of Gb major in your tenor saxophone using primarily octave intervals."
                    ]
                },
                {
                    "short_id": "minor_octaves",
                    "front": [
                        "Explore the minor scale in the equivalent minor mode to Gb major in your tenor saxophone using primarily octave intervals."
                    ]
                }
            ]
        }
    ]
}